/*
    大马驮2石粮食，中马驮1石粮食，两头小马驮一石粮食，要用100匹马，驮100石粮食，输出所有可行的调配方式？
    首先可以看出题目中有几个固定条件：
        1.三匹马的总数要等于100
        2.驮的粮食总数要等于100
        3.小马不能出现单数
        4.循环的条件其实也就是判断大马、中马的范围，只有在这两种马可购买的匹数范围内才能继续向下进行。
 */
public class Demo4 {
    public static void main(String[] args) {
        int count = 0;
        //x代表大马、y代表中马、z代表小马
        for (int x = 0; x <= 50; x++) {
            for (int y = 0; y <= 100; y++) {
                int z = 100 - x - y;
                if (x + y + z == 100 && 2 * x + y + z / 2 == 100 && z % 2 == 0) {
                    count++;
                    System.out.println(count+"种方案 "+x+"只大马 "+y+"只中马 "+z+"只小马");
                }
            }
        }

    }
}
